//===================================================================
//
//3Dアクション(light.cpp)
//Author:大原隆俊
//
//===================================================================
//===================================================================
//インクルードファイル
//===================================================================
#include "main.h"
#include "light.h"

//===================================================================
//グローバル変数
//===================================================================
D3DLIGHT9 g_alight[MAX_LIGHT];		//ライト情報

//===================================================================
//ライト初期化
//===================================================================
void InitLight(void)
{
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	D3DXVECTOR3 vecDir;	//ライトの方向ベクトル

	//ライトをクリアする
	ZeroMemory(&g_alight, sizeof(g_alight)); //構造体変数をクリアできる便利関数

	//---------------------------------------------------------------
	//ライト一つ目設置
	//---------------------------------------------------------------
	//ライトの種類設定
	g_alight[0].Type = D3DLIGHT_DIRECTIONAL;	//平行光源

	//ライトの拡散光を設定
	g_alight[0].Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	//ライトの方向設定
	vecDir = D3DXVECTOR3(1.0f, -1.0f, -2.0f);

	//正規化する（大きさ1のベクトルにする）
	D3DXVec3Normalize(&vecDir, &vecDir);
	g_alight[0].Direction = vecDir;

	//ライトの設定
	pDevice->SetLight(0, &g_alight[0]);

	//ライトを有効にする
	pDevice->LightEnable(0, TRUE);

	//---------------------------------------------------------------
	//ライト二つ目設置
	//---------------------------------------------------------------
	//ライトの種類設定
	g_alight[1].Type = D3DLIGHT_DIRECTIONAL;	//平行光源

	//ライトの拡散光を設定
	g_alight[1].Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	//ライトの方向設定
	vecDir = D3DXVECTOR3(1.0f, -1.0f, 2.0f);

	//正規化する（大きさ1のベクトルにする）
	D3DXVec3Normalize(&vecDir, &vecDir);
	g_alight[1].Direction = vecDir;

	//ライトの設定
	pDevice->SetLight(0, &g_alight[1]);

	//ライトを有効にする
	pDevice->LightEnable(0, TRUE);

	//---------------------------------------------------------------
	//ライト三つ目設置
	//---------------------------------------------------------------
	//ライトの種類設定
	g_alight[2].Type = D3DLIGHT_DIRECTIONAL;	//平行光源

	//ライトの拡散光を設定
	g_alight[2].Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);

	//ライトの方向設定
	vecDir = D3DXVECTOR3(0.0f, -1.0f, 0.0f);

	//正規化する（大きさ1のベクトルにする）
	D3DXVec3Normalize(&vecDir, &vecDir);
	g_alight[2].Direction = vecDir;

	//ライトの設定
	pDevice->SetLight(0, &g_alight[2]);

	//ライトを有効にする
	pDevice->LightEnable(0, TRUE);
}

//===================================================================
//ライト終了処理
//===================================================================
void UninitLight(void)
{

}

//===================================================================
//ライト更新処理
//===================================================================

void UpdateLight(void)
{

}