//===================================================================
//
//3Dアクション(meshfield.h)
//Author:大原隆俊
//
//===================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

//===================================================================
//メッシュフィールド構造体
//===================================================================
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	D3DXVECTOR3 rot;		//方向
	D3DXMATRIX mtxWorld;	//ワールドマトリックス
}Meshfield;

//===================================================================
//プロトタイプ宣言
//===================================================================
void InitMeshfield(void);
void UninitMeshfield(void);
void UpdateMeshfield(void);
void DrawMeshfield(void);

#endif 
