//-----------------------------------------------------------------------------------------------
//
// カウントダウン処理[countDown.cpp]
// Author : 平野舞
//
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------------------------
#include "countDown.h"			// カウントダウン
#include "TextureFileName.h"	// 画像のファイル名

//-----------------------------------------------------------------------------------------------
// 定数宣言
//-----------------------------------------------------------------------------------------------
// 幅
static const float COUNTDOWN_WIDTH = 500.0f;
// 高さ
static const float COUNTDOWN_HEIGHT = 500.0f;

//-----------------------------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------------------------
CCountDown::CCountDown()
	:m_nCntFrame(0), m_nCountDown(0)
{

}

//-----------------------------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------------------------
CCountDown::~CCountDown()
{

}

//-----------------------------------------------------------------------------------------------
// 生成
//-----------------------------------------------------------------------------------------------
CCountDown* CCountDown::Create(const D3DXVECTOR3& pos)
{
	// ポインタクラス宣言
	CCountDown* pCountDown = new CCountDown;

	if (pCountDown != nullptr)
	{// nullptrではなかったら
	 // 位置
		pCountDown->SetPosition(pos);
		// 初期化する
		pCountDown->Init();
	}

	return pCountDown;
}

//-----------------------------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------------------------
HRESULT CCountDown::Init()
{
	// 停止中
	CObject::SetPause(true);

	// 親設定
	CObject::SetObjectParent(CObject::EOBJECT_PARENT_PAUSE);
	//オブジェクトタイプを設定
	SetObjectType(EOBJECT_TYPE::EOBJECT_TYPE_COUNTDOWN);
	// テクスチャの設定
	CObject2D::LoadTexture(TEX_COUNTDOWN);
	// サイズ
	CObject2D::SetSize(D3DXVECTOR3(COUNTDOWN_WIDTH, COUNTDOWN_HEIGHT, 0.0f));

	CObject2D::Init();

	// テクスチャ座標
	CObject2D::SetTexAnim(3, 1, 0, 0);

	return S_OK;
}

//-----------------------------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------------------------
void CCountDown::Uninit()
{
	CObject2D::Uninit();
}

//-----------------------------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------------------------
void CCountDown::Update()
{
	// タイムを足していく
	m_nCntFrame++;

	if (m_nCntFrame >= 60 && m_nCountDown <= 3)
	{
		// カウントダウン用タイムを足していく
		m_nCountDown++;

		switch (m_nCountDown)
		{// カウントダウン用タイム
		case 1:
			// テクスチャ座標の初期化
			CObject2D::SetTexAnim(3, 1, 1, 0);
			break;
		case 2:
			// テクスチャ座標の初期化
			CObject2D::SetTexAnim(3, 1, 2, 0);
			break;
		case 3:
			// 停止を解除
			CObject2D::SetPause(false);
			// 終了する
			Uninit();
			break;
		}

		// タイムをリセットする
		m_nCntFrame = 0;
	}
}

//-----------------------------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------------------------
void CCountDown::Draw()
{
	CObject2D::Draw();
}