//-----------------------------------------------------------------------------------------------
//
// プレイヤーの処理[player.cpp]
// Author : 平野舞
//
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------------------------
#include "life.h"			// 寿命
#include "object2D.h"		// オブジェクト2D
#include "application.h"	// アプリケーション
#include "renderer.h"		// レンダリング
#include "TextureFileName.h"	// 画像のファイル名

//-----------------------------------------------------------------------------------------------
// 定数宣言
//-----------------------------------------------------------------------------------------------
// 幅
static const float LIFE_WIDTH = 40.0f;
// 高さ
static const float LIFE_HEIGHT = 40.0f;

//-----------------------------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------------------------
CLife::CLife()
{
	for (int nCntLife = 0; nCntLife < MAX_LIFE; nCntLife++)
	{
		m_paObject2D[nCntLife] = nullptr;
	}
}

//-----------------------------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------------------------
CLife::~CLife()
{

}

//-----------------------------------------------------------------------------------------------
// 生成
//
//const D3DXVECTOR3& pos → 生成する座標位置
//-----------------------------------------------------------------------------------------------
CLife* CLife::Create(const D3DXVECTOR3& pos)
{
	// ポインタクラスを宣言
	CLife* pLife = new CLife;

	if (pLife != nullptr)
	{// もしnullptrではなかったら
	 // 初期化
		pLife->Init(pos);
	}

	return pLife;
}

//-----------------------------------------------------------------------------------------------
// 初期化
//
// const D3DXVECTOR3& pos → 最初に表示する座標位置
//-----------------------------------------------------------------------------------------------
HRESULT CLife::Init(const D3DXVECTOR3& pos)
{
	for (int nCntLife = 0; nCntLife < MAX_LIFE; nCntLife++)
	{
		// オブジェクト2Dを生成
		m_paObject2D[nCntLife] = CObject2D::Create(D3DXVECTOR3(pos.x + (45.0f * nCntLife),pos.y,0.0f) , D3DXVECTOR3(LIFE_WIDTH, LIFE_HEIGHT, 0.0f));
	}

	//オブジェクトタイプを設定
	SetObjectType(OBJECT_TYPE::OBJECT_TYPE_LIFE);
	SetObjectParent(OBJECT_PARENT::OBJECT_PARENT_GAME);

	for (int nCntLife = 0; nCntLife < MAX_LIFE; nCntLife++)
	{
		// テクスチャの設定
		m_paObject2D[nCntLife]->LoadTexture(TEX_LIFE);
	}

	return S_OK;
}

//-----------------------------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------------------------s
void CLife::Uninit()
{
	for (int nCntLife = 0; nCntLife < MAX_LIFE; nCntLife++)
	{
		if (m_paObject2D[nCntLife] != nullptr)
		{// nullptrではなかったら
			m_paObject2D[nCntLife]->Uninit();
		}
	}
}

//-----------------------------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------------------------
void CLife::Update()
{

}

//-----------------------------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------------------------
void CLife::Draw()
{
	
}

//-----------------------------------------------------------------------------------------------
// 削除する
//-----------------------------------------------------------------------------------------------
void CLife::Delete(int nCntLife)
{
	if (m_paObject2D[nCntLife] != nullptr)
	{
		// 終了
		m_paObject2D[nCntLife]->Uninit();

		// nullptrにする
		m_paObject2D[nCntLife] = nullptr;
	}
}